---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarBendingDetailType.BendDiameterDimensionsForHooksEnabled
source: html/510bc298-67bc-2132-d348-2e6ffc272451.htm
---
# Autodesk.Revit.DB.Structure.RebarBendingDetailType.BendDiameterDimensionsForHooksEnabled Property

Identifies if radial or diameter dimensions will be shown for hook fillets.
 This property has a meaning only if BendDiameterDimensionsEnabled is set to true.

## Syntax (C#)
```csharp
public bool BendDiameterDimensionsForHooksEnabled { get; set; }
```